TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_hal.c
/**
  ******************************************************************************
  * @file    stm32wlxx_app_radio_hal.c
  * @brief   hardware-specific operations to drive the Sidewalk STM32WLxx Radio
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

/* STD headers */
#include <stdint.h>

/* Sidewalk SDK headers */
#include <sid_pal_assert_ifc.h>
#include <sid_pal_critical_region_ifc.h>
#include <sid_pal_delay_ifc.h>
#include <sid_pal_gpio_ifc.h>
#include <sid_pal_gpio_ext_ifc.h>
#include <sid_pal_log_ifc.h>
#include <sid_pal_serial_bus_ext_ifc.h>
#include <sid_pal_uptime_ifc.h>
#include <sid_time_ops.h>
#include <sid_time_types.h>

/* Radio driver headers */
#include <comm_def.h>
#include <comm_opcodes.h>
#include "stm32wlxx_app_radio_config.h"
#include "stm32wlxx_app_radio.h"
#include "stm32wlxx_app_radio_hal.h"
#include "stm32wlxx_phy.h"

/* ST HW platform headers */
#include <sid_stm32_common_utils.h>
#include "stm32wbaxx_hal.h"

/* OS */
#include "cmsis_os2.h"

/* LPM handling */
#include "app_conf.h"

/* Private defines -----------------------------------------------------------*/

#define STM32WLxx_HAL_IRQ_LINE_GPIO_SETTLE_TIME_US          (75u)  /* Delay after configuring the GPIO as input with a PU/PD to allow it to settle */
#define STM32WLxx_HAL_GPIO_HANDSHAKE_WAIT_TIMEOUT_MS        (200u) /* The time given to the STM32WLxx to react on GPIO handshake request */
#define STM32WLxx_HAL_GPIO_HANDSHAKE_PROBE_PERIOD_MS        (1u)   /* The pause between the continuous GPIO handshake state probes */

#define STM32WLxx_HAL_RADIO_REQUEST_ACK_PROBE_PERIOD_US     (100u) /* If SubGHz request is running in IRQ context the handler will use polling with this period to check if the request was completed */

#define STM32WLxx_HAL_RADIO_SUBGHZ_RESET_TIMEOUT_MS         (50u)  /* Time limit for STM32WLxx completing the SubGHz Reset request and reporting back to the host MCU */
#define STM32WLxx_HAL_RADIO_SUBGHZ_STANDBY_TIMEOUT_MS       (20u)  /* Time limit for STM32WLxx completing the SubGHz Standby request and reporting back to the host MCU */
#define STM32WLxx_HAL_RADIO_SUBGHZ_SLEEP_TIMEOUT_MS         (5u)   /* Time limit for STM32WLxx completing the SubGHz Sleep mode request and reporting back to the host MCU */
#define STM32WLxx_HAL_RADIO_SUBGHZ_SEND_CFG_TIMEOUT_MS      (2u)   /* Time limit for STM32WLxx for acknowledging the reception of the supplied SubGHz configuration */
#define STM32WLxx_HAL_RADIO_SUBGHZ_APPLY_CFG_TIMEOUT_MS     (30u)  /* Time limit for STM32WLxx completing the application of the supplied SubGHz configuration */
#define STM32WLxx_HAL_RADIO_SUBGHZ_GET_LIVE_RSSI_TIMEOUT_MS (5u)   /* Time limit for STM32WLxx to read live RSSI on the current Rx channel */
#define STM32WLxx_HAL_RADIO_SUBGHZ_IS_CH_FREE_TIMEOUT_MS    (25u)  /* Time limit for STM32WLxx to check if a single radio channel is free */
#define STM32WLxx_HAL_RADIO_SUBGHZ_GET_CH_NOISE_TIMEOUT_MS  (50u)  /* Time limit for STM32WLxx to measure signal noise on a single radio channel */

#define STM32WLxx_HAL_RADIO_SUBGHZ_SPI_FLUSH_ATTEMPTS       (100u) /* Maximum amount of dummy reads to flush SPI communication - STM32WLxx shall sent a dummy frame before this limit is reached */

#ifndef STM32WLxx_RADIO_APP_LPM_SUPPORT
#  error "STM32WLxx_RADIO_APP_LPM_SUPPORT is not defined. Please set it explicitly to 0 or 1"
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */

#if STM32WLxx_RADIO_APP_LPM_SUPPORT
#  ifndef STM32WLxx_HAL_STM32WLxx_WAKEUP_TIME_US
#    define STM32WLxx_HAL_STM32WLxx_WAKEUP_TIME_US          (STM32WLxx_HAL_STM32WLxx_DEFAULT_WAKEUP_TIME_US) /* STM32WLxx wakeup delay to be able to accept SPI transfers - HAL will wait at least for this time to allow STM32WLxx to wakeup and restart the AHB/APB clocks. IMPORTANT: this is not a full wakeup, it's just the time required to restart the clocks */
#  endif /* STM32WLxx_HAL_STM32WLxx_WAKEUP_TIME_US */
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */

/* Private macro -------------------------------------------------------------*/

#ifndef STM32WLxx_HAL_EXTRA_LOGGING
/* Set STM32WLxx_HAL_EXTRA_LOGGING to 1 to enable extended logs */
#  define STM32WLxx_HAL_EXTRA_LOGGING (0)
#endif

#if defined(STM32WLxx_HAL_EXTRA_LOGGING) && STM32WLxx_HAL_EXTRA_LOGGING
#  define STM32WLxx_HAL_LOG_ERROR(...)   SID_PAL_LOG_ERROR(__VA_ARGS__)
#  define STM32WLxx_HAL_LOG_WARNING(...) SID_PAL_LOG_WARNING(__VA_ARGS__)
#  define STM32WLxx_HAL_LOG_INFO(...)    SID_PAL_LOG_INFO(__VA_ARGS__)
#  define STM32WLxx_HAL_LOG_DEBUG(...)   SID_PAL_LOG_DEBUG(__VA_ARGS__)
#  define STM32WLxx_HAL_LOG_TRACE(...)   SID_PAL_LOG_TRACE(__VA_ARGS__)
#else
#  define STM32WLxx_HAL_LOG_ERROR(...)   ((void)0u)
#  define STM32WLxx_HAL_LOG_WARNING(...) ((void)0u)
#  define STM32WLxx_HAL_LOG_INFO(...)    ((void)0u)
#  define STM32WLxx_HAL_LOG_DEBUG(...)   ((void)0u)
#  define STM32WLxx_HAL_LOG_TRACE(...)   ((void)0u)
#endif

/* Private function prototypes -----------------------------------------------*/

static inline stm32wlxx_hal_status_t _spi_transmit_receive_full_frame(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const tx_buf,
                                                                      uint8_t * const rx_buf, const size_t data_length);
static inline stm32wlxx_hal_status_t _spi_transmit_receive_partial_frame(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const tx_buf,
                                                                         uint8_t * const rx_buf, const size_t data_length);
static        stm32wlxx_hal_status_t _spi_transmit_data(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const data, const size_t data_length);

static        stm32wlxx_hal_status_t _spi_receive_data(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, uint8_t * const rx_buf,
                                                       const size_t buf_size, size_t * const bytes_received);
static        stm32wlxx_hal_status_t _spi_transmit_receive_data(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const tx_data,
                                                                uint8_t * const rx_data, const size_t data_length);
static         stm32wlxx_hal_status_t _flush_spi(const halo_drv_stm32wlxx_ctx_t * const drv_ctx);
static         stm32wlxx_hal_status_t _send_request_with_ack(halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const tx_data,
                                                             const size_t data_length, const uint32_t timeout_ms);
static inline  uint32_t               _radio_irq_gpio_filtered_read(const halo_drv_stm32wlxx_ctx_t * const drv_ctx);
static         void                   _on_radio_irq_detected(uint32_t pin, void * callback_arg);

/* Private function definitions ----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline stm32wlxx_hal_status_t _spi_transmit_receive_full_frame(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const tx_buf, uint8_t * const rx_buf, const size_t data_length)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    sid_error_t sid_err;

    SID_PAL_ASSERT(data_length == STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE);

    do
    {
#if STM32WLxx_RADIO_APP_LPM_SUPPORT
        /* If STM32WLxx can be in an LPM we need to activate NSS and hold it to wakeup the MCU */
        uint32_t wakeup_delay_required = ((SID_PAL_RADIO_SLEEP == drv_ctx->radio_state) || (SID_PAL_RADIO_UNKNOWN == drv_ctx->radio_state)) && (FALSE == drv_ctx->ldt_ongoing) ? TRUE : FALSE;
        if ((wakeup_delay_required != FALSE) && (SID_PAL_RADIO_SLEEP == drv_ctx->radio_state))
        {
            /* There's a special use case for radio in SID_PAL_RADIO_SLEEP but indicating active IRQ - we don't need to wait for wakeup here */
            const uint32_t radio_irq_pin_state = _radio_irq_gpio_filtered_read(drv_ctx);

            if (STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_ACTIVE == radio_irq_pin_state)
            {
                wakeup_delay_required = FALSE;
            }
        }

