TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_hal.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static stm32wlxx_hal_status_t _spi_receive_data(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, uint8_t * const rx_buf,
                                                                          const size_t buf_size, size_t * const bytes_received)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;

    /* Protect from systematic SW failures */
    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->bus_iface != NULL);
    SID_PAL_ASSERT(drv_ctx->bus_iface->xfer != NULL);

    halo_drv_stm32wlxx_ctx_t * const modifiable_drv_ctx = (halo_drv_stm32wlxx_ctx_t *)drv_ctx;

    /* Capture STM32WLxx IRQ line status before the transaction */
    const uint32_t irq_was_enabled = drv_ctx->irq_enabled;

    do
    {
        /* Use dummy frame to guarantee that the dummy OpCode will be transferred */
        const stm32wlxx_radio_comm_spi_frame_t dummy_tx_frame = {
            .opcode = STM32WLxx_RADIO_COMM_OPCODE_DUMMY_DATA,
            .payload = {
                .raw = {0u},
            }
        };
        stm32wlxx_radio_comm_spi_frame_t rx_frame;
        uint8_t * ingest_ptr = rx_buf;
        size_t expected_length;
        size_t received_length;

        /* Validate inputs */
        if (NULL == rx_buf)
        {
            if (0u == buf_size)
            {
                STM32WLxx_HAL_LOG_DEBUG("Performing dummy STM32WLxx SPI Rx transaction - all the received data will be discarded");
            }
            else
            {
                err = STM32WLxx_HAL_STATUS_INVALID_ARGS;
                STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI Rx failed - invalid args (null rx buffer with non-zero length)");
                break;
            }
        }
        else
        {
            if (0u == buf_size)
            {
                err = STM32WLxx_HAL_STATUS_INVALID_ARGS;
                STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI Rx failed - invalid args (non-null rx buffer with zero length)");
                break;
            }
        }

        if (bytes_received != NULL)
        {
            /* Set default value */
            *bytes_received = 0u;
        }

        /* Disable all STM32WLxx IRQs - if an IRQ is indicated during the ongoing transfer, the IRQ handler will try to read out IRQ status, causing clashes on the SPI line */
        err = stm32wlxx_hal_disarm_irq(modifiable_drv_ctx);
        if (err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI Tx failed - unble to disarm IRQ line. error %u", (uint32_t)err);
            break;
        }

        /* Unconditionally receive the first frame */
        err = _spi_transmit_receive_full_frame(drv_ctx, (uint8_t *)(void *)&dummy_tx_frame, (uint8_t *)(void *)&rx_frame, sizeof(rx_frame));
        if (err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI Rx failed - SPI error %u", (uint32_t)err);
            break;
        }

        /* Inspect the frame - it may indicate long data */
        if (STM32WLxx_RADIO_COMM_OPCODE_LONG_DATA_START == rx_frame.opcode)
        {
            /* This is the start of the long data - more frames are pending */
            const stm32wlxx_rcp_ldts_t * const start_payload = &rx_frame.payload.ldts;
            expected_length = (size_t)start_payload->full_data_size;

            /* Perform the validity check */
            if (expected_length <= sizeof(start_payload->partial_data))
            {
                SID_PAL_LOG_ERROR("Invalid long data start frame - full data length (%u) is too short", expected_length); /* This a serious error, always log it */
                err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
                break;
            }

            STM32WLxx_HAL_LOG_DEBUG("Received long data start payload from STM32WLxx. Full data length: %u", expected_length);

            if (rx_buf != NULL)
            {
                if (expected_length > buf_size)
                {
                    STM32WLxx_HAL_LOG_ERROR("Unable to receive long data - supplied Rx buffer is too short");
                    err = STM32WLxx_HAL_STATUS_ERROR_BUFFER_OVERFLOW;
                    break;
                }

                /* Copy partial data */
                SID_STM32_UTIL_fast_memcpy(ingest_ptr, start_payload->partial_data, sizeof(start_payload->partial_data));
            }
            else
            {
                /* Perform dummy read */
            }

            /* Advance the pointers & counters regardless if it is normal or dummy read */
            received_length = sizeof(start_payload->partial_data);
            ingest_ptr += received_length;

#if STM32WLxx_RADIO_APP_LPM_SUPPORT
            /* Indicate active LDT so SPI comm will assume the STM32WLxx side does not need wakeup till the end of the current LDT frame */
            modifiable_drv_ctx->ldt_ongoing = TRUE;
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */
        }
        else if (STM32WLxx_RADIO_COMM_OPCODE_LONG_DATA_CONT == rx_frame.opcode)
        {
            /* Invalid state - we've got long data continuation without getting long data start */
            STM32WLxx_HAL_LOG_ERROR("Unexpectedly received long data continuation frame from STM32WLxx");
            if (bytes_received != NULL)
            {
                *bytes_received = 0u;
            }
            err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
            break;
        }
        else
        {
            /* This is a generic single-frame message */
            if (rx_buf != NULL)
            {
                /* Store the received data */
                const size_t copy_length = buf_size > sizeof(rx_frame) ? sizeof(rx_frame) : buf_size; /* Allow storing partial single frames as the valid payload may be shorter than an SPI frame */
                SID_STM32_UTIL_fast_memcpy(rx_buf, (uint8_t *)(void *)&rx_frame, copy_length);

                /* Provide how many bytes we've received if possible */
                if (bytes_received != NULL)
                {
                    *bytes_received = copy_length;
                }

                STM32WLxx_HAL_LOG_DEBUG("Received single-frame payload from STM32WLxx, stored %u bytes", copy_length);
            }
            else
            {
                STM32WLxx_HAL_LOG_DEBUG("Completed single-frame dummy read from STM32WLxx");
            }

            err = STM32WLxx_HAL_STATUS_OK;
            break;
        }

        /* Proceed with receiving the reminder of the long data */
        while (received_length < expected_length)
        {
            const stm32wlxx_rcp_ldtc_t * const continuation_payload = &rx_frame.payload.ldtc;

            err = _spi_transmit_receive_full_frame(drv_ctx, (uint8_t *)(void*)&dummy_tx_frame, (uint8_t *)(void*)&rx_frame, sizeof(rx_frame));
            if (err != STM32WLxx_HAL_STATUS_OK)
            {
                /* Something went wrong */
                break;
            }

            /* Ensure we've got expected data */
            if (rx_frame.opcode != STM32WLxx_RADIO_COMM_OPCODE_LONG_DATA_CONT)
            {
                /* Invalid state - we've not got long data continuation  */
                STM32WLxx_HAL_LOG_ERROR("Unexpectedly received opcode 0x%x instead of long data continuation frame from STM32WLxx", rx_frame.opcode);
                err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
                break;
            }

