TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_hal.c
            /* This is a valid long data continuation, add partial data to the Rx buffer */
            const size_t copy_length = (expected_length - received_length) > sizeof(continuation_payload->partial_data) ? sizeof(continuation_payload->partial_data) : (expected_length - received_length);

            if (rx_buf != NULL)
            {
                SID_STM32_UTIL_fast_memcpy(ingest_ptr, continuation_payload->partial_data, copy_length);
                STM32WLxx_HAL_LOG_DEBUG("Received %u bytes of long data continuation from STM32WLxx. Total bytes received: %u", copy_length, received_length);
            }
            else
            {
                /* Perform dummy read */
            }

            /* Advance the pointers & counters regardless if it is normal or dummy read */
            received_length += copy_length;
            ingest_ptr += copy_length;
        }

        if (bytes_received != NULL)
        {
            *bytes_received = received_length;
        }
    } while (0);

#if STM32WLxx_RADIO_APP_LPM_SUPPORT
    /* Ensure LDT status is cleaned regardless of the outcome */
    modifiable_drv_ctx->ldt_ongoing = FALSE;
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */

    if (irq_was_enabled != FALSE)
    {
        /* Ensure the IRQs are re-enabled after the transaction */
        stm32wlxx_hal_status_t rearm_err = stm32wlxx_hal_arm_irq(modifiable_drv_ctx);
        if (rearm_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI TxRx failed - unble to re-arm IRQ line. error %u", (uint32_t)rearm_err);
        }

        if (STM32WLxx_HAL_STATUS_OK == err)
        {
            err = rearm_err;
        }
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static stm32wlxx_hal_status_t _spi_transmit_receive_data(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const tx_data, uint8_t * const rx_data, const size_t data_length)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;

    /* Protect from systematic SW failures */
    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->bus_iface != NULL);
    SID_PAL_ASSERT(drv_ctx->bus_iface->xfer != NULL);

    halo_drv_stm32wlxx_ctx_t * const modifiable_drv_ctx = (halo_drv_stm32wlxx_ctx_t *)drv_ctx;

    /* Capture STM32WLxx IRQ line status before the transaction */
    const uint32_t irq_was_enabled = drv_ctx->irq_enabled;

    do
    {
        /* Validate inputs */
        if ((NULL == tx_data) || (NULL == rx_data) || (0u == data_length))
        {
            err = STM32WLxx_HAL_STATUS_INVALID_ARGS;
            STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI TxRx failed - invalid args");
            break;
        }

        /* Disable all STM32WLxx IRQs - if an IRQ is indicated during the ongoing transfer, the IRQ handler will try to read out IRQ status, causing clashes on the SPI line */
        err = stm32wlxx_hal_disarm_irq(modifiable_drv_ctx);
        if (err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI Tx failed - unble to disarm IRQ line. error %u", (uint32_t)err);
            break;
        }

        if (STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE == data_length)
        {
            /* Data perfectly matches the SPI data frame size - transfer as is */
            err = _spi_transmit_receive_full_frame(drv_ctx, tx_data, rx_data, data_length);
            if (err != STM32WLxx_HAL_STATUS_OK)
            {
                break;
            }
        }
        else if (data_length > STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE)
        {
            /* Data size exceeds single SPI frame - transfer as long data */
            STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI TxRx failed - simultaneous Tx and Rx of long data is not supported");
            err = STM32WLxx_HAL_STATUS_ERROR_NOT_SUPPORTED;
            break;
        }
        else
        {
            /* Data size is smaller than a single SPI frame - use padding */
            err = _spi_transmit_receive_partial_frame(drv_ctx, tx_data, rx_data, data_length);
            if (err != STM32WLxx_HAL_STATUS_OK)
            {
                break;
            }
        }
    } while (0);

    if (irq_was_enabled != FALSE)
    {
        /* Ensure the IRQs are re-enabled after the transaction */
        stm32wlxx_hal_status_t rearm_err = stm32wlxx_hal_arm_irq(modifiable_drv_ctx);
        if (rearm_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI TxRx failed - unble to re-arm IRQ line. error %u", (uint32_t)rearm_err);
        }

        if (STM32WLxx_HAL_STATUS_OK == err)
        {
            err = rearm_err;
        }
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static stm32wlxx_hal_status_t _flush_spi(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    uint32_t remaining_attempts = STM32WLxx_HAL_RADIO_SUBGHZ_SPI_FLUSH_ATTEMPTS;

    do
    {
        stm32wlxx_radio_comm_spi_frame_t rx_frame;
        size_t bytes_received;

        /* Perform a dummy read */
        err = _spi_receive_data(drv_ctx, (uint8_t *)(void *)&rx_frame, sizeof(rx_frame), &bytes_received);
        if ((err != STM32WLxx_HAL_STATUS_OK) || (bytes_received != sizeof(rx_frame)))
        {
            STM32WLxx_HAL_LOG_ERROR("Failed perform dummy SPI read. Error %u, bytes rcvd: %u", (int32_t)err, bytes_received);
            break;
        }

        if (STM32WLxx_RADIO_COMM_OPCODE_DUMMY_DATA == rx_frame.opcode)
        {
            /* Flushing done, STM32WLxx sent dummy frame */
            err = STM32WLxx_HAL_STATUS_OK;
            break;
        }

        /* Check if the  */
        --remaining_attempts;
        if (0u == remaining_attempts)
        {
            err = STM32WLxx_HAL_STATUS_ERROR_TIMEOUT;
            STM32WLxx_HAL_LOG_ERROR("Failed to flush SPI - attempts limit reached, STM32WLxx still provides non-dummy data");
            break;
        }
    } while (0);

