TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_hal.c
stm32wlxx_hal_status_t stm32wlxx_hal_generic_irq_process(halo_drv_stm32wlxx_ctx_t * const drv_ctx, int32_t * const out_sidewalk_error)
{
    stm32wlxx_hal_status_t hal_err;
    uint32_t handshake_request_active = FALSE;

    STM32WLxx_HAL_LOG_DEBUG("radio_stm32wlxx_on_irq_detected...");

    SID_PAL_ASSERT(drv_ctx != NULL);

    if (out_sidewalk_error != NULL)
    {
        *out_sidewalk_error = RADIO_ERROR_NONE;
    }

    /* Perform filtering since Open-Drain line is not immune to EMI and noise ----*/
    const uint32_t radio_irq_pin_state = _radio_irq_gpio_filtered_read(drv_ctx);

    if (radio_irq_pin_state != STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_ACTIVE)
    {
        /* Seems the IRQ was accidentally triggered by a glitch - ignore it */
        return STM32WLxx_HAL_STATUS_OK;
    }
    /*----------------------------------------------------------------------------*/

    /* Proceed with regular IRQ handling -----------------------------------------*/
    register uint32_t trigger_sid_radio_event_handler = FALSE;
    register uint32_t indicate_radio_request_completed = FALSE;

    do
    {
        /* Read out IRQ status and any potential follow-up data */
        SID_PAL_ASSERT(drv_ctx->config                       != NULL);
        SID_PAL_ASSERT(drv_ctx->config->internal_buffer.p    != NULL);
        SID_PAL_ASSERT(drv_ctx->config->internal_buffer.size >  0u);
        hal_err = stm32wlxx_hal_retrieve_radio_irq(drv_ctx, &drv_ctx->last_irq_status, drv_ctx->config->internal_buffer.p, drv_ctx->config->internal_buffer.size);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Unable to retrieve STM32WLxx IRQ status. HAL error %u", (uint32_t)hal_err);
            goto recovery;
        }

        /* Store a copy of the received IRQ status */
        const stm32wlxx_app_irq_mask_t active_irq = (stm32wlxx_app_irq_mask_t)drv_ctx->last_irq_status.irq_flags;

        STM32WLxx_HAL_LOG_DEBUG("Retrieved STM32WLxx IRQ status. IRQ flags: 0x%x, follow-up data size: %u", drv_ctx->last_irq_status.irq_flags, drv_ctx->last_irq_status.followup_payload_len);

        switch (active_irq)
        {
            case STM32WLxx_APP_IRQ_NONE:
                SID_PAL_LOG_WARNING("STM32WLxx Radio App IRQ reported with no flags set - ignoring event");
                hal_err = STM32WLxx_HAL_STATUS_ERROR_INVALID_STATE;
                break;

            case STM32WLxx_APP_IRQ_SUBGHZ:
                /* This is a SubGHz radio event, pass it to the Sidewalk stack */
                if ((drv_ctx->app_irq_mask & active_irq) != 0u)
                {
                    SID_PAL_ASSERT(drv_ctx->radio_rx_packet != NULL);

                    /* Apply the radio event timestamp compensation as reported by the STM32WLxx to drv_ctx->radio_rx_packet->rcv_tm. The initial timestamp value is captured at the moment when GPIO IRQ is detected */
                    const stm32wlxx_subghz_irq_details_t * const subghz_irq_details = &drv_ctx->last_irq_status.subghz_irq_details;
                    struct sid_timespec irq_timestamp_compensation = {
                        .tv_sec = 0u,
                        .tv_nsec = subghz_irq_details->compensatory_ns,
                    };
                    if (sid_time_lt(&drv_ctx->radio_rx_packet->rcv_tm, &irq_timestamp_compensation) == FALSE)
                    {
                        sid_time_sub(&drv_ctx->radio_rx_packet->rcv_tm, &irq_timestamp_compensation);
                    }
                    else
                    {
                        /* Time cannot be negative so our best option is to report zero */
                        drv_ctx->radio_rx_packet->rcv_tm.tv_sec  = 0u;
                        drv_ctx->radio_rx_packet->rcv_tm.tv_nsec = 0u;
                    }

                    /* Provide any received additional payload */
                    if (drv_ctx->last_irq_status.followup_payload_len > 0u)
                    {
                        const stm32wlxx_rcp_set_subghz_rx_buf_t * const subghz_additional_data = (stm32wlxx_rcp_set_subghz_rx_buf_t *)(void *)drv_ctx->config->internal_buffer.p;
                        if (subghz_additional_data->opcode != STM32WLxx_RADIO_COMM_OPCODE_RAW_DATA)
                        {
                            SID_PAL_LOG_ERROR("Invalid SubGHz IRQ follow-up data. Expected OpCode 0x%02X but got 0x%02X", STM32WLxx_RADIO_COMM_OPCODE_RAW_DATA, subghz_additional_data->opcode);
                            hal_err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
                            break;
                        }

                        drv_ctx->radio_rx_packet->payload_len = drv_ctx->last_irq_status.followup_payload_len - (sizeof(*subghz_additional_data) - sizeof(subghz_additional_data->subghz_rx_buf));
                        SID_PAL_ASSERT(sizeof(drv_ctx->radio_rx_packet->rcv_payload) >= drv_ctx->radio_rx_packet->payload_len);
                        SID_STM32_UTIL_fast_memcpy(drv_ctx->radio_rx_packet->rcv_payload, subghz_additional_data->subghz_rx_buf, drv_ctx->radio_rx_packet->payload_len);
                    }
                    else
                    {
                        drv_ctx->radio_rx_packet->payload_len = 0u;
                    }

                    /* Indicate that Sidewalk's radio event handler shall be invoked */
                    trigger_sid_radio_event_handler = TRUE;
                }
                else
                {
                    STM32WLxx_HAL_LOG_DEBUG("STM32WLxx_APP_IRQ_SUBGHZ is masked - skipped");
                }
                hal_err = STM32WLxx_HAL_STATUS_OK;
                break;

            case STM32WLxx_APP_IRQ_SPI_REQ_DONE:
                if ((drv_ctx->app_irq_mask & active_irq) != 0u)
                {
                    indicate_radio_request_completed = TRUE;
                }
                else
                {
                    STM32WLxx_HAL_LOG_DEBUG("STM32WLxx_APP_IRQ_SPI_REQ_DONE is masked - skipped");
                }
                hal_err = STM32WLxx_HAL_STATUS_OK;
                break;

            case STM32WLxx_APP_IRQ_SPI_HANDSHAKE:
                if ((drv_ctx->app_irq_mask & active_irq) != 0u)
                {
                    SID_PAL_LOG_WARNING("STM32WLxx APP indicated a handshake request");
                    handshake_request_active = TRUE;
                }
                else
                {
                    STM32WLxx_HAL_LOG_DEBUG("STM32WLxx_APP_IRQ_SPI_HANDSHAKE is masked - skipped");
                }
                hal_err = STM32WLxx_HAL_STATUS_OK;
                break;

