TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_hal.c
            case STM32WLxx_APP_IRQ_USER_DATA:
                if ((drv_ctx->app_irq_mask & active_irq) != 0u)
                {
                    STM32WLxx_HAL_LOG_DEBUG("STM32WLxx APP - received incoming user data");
                    if (drv_ctx->on_user_data_rx != NULL)
                    {
                        const stm32wlxx_rcp_user_data_irq_followup_t * const user_data_frame = (stm32wlxx_rcp_user_data_irq_followup_t *)(void *)drv_ctx->config->internal_buffer.p;
                        if (user_data_frame->opcode != STM32WLxx_RADIO_COMM_OPCODE_USER_DATA)
                        {
                            SID_PAL_LOG_ERROR("Invalid User Data IRQ follow-up frame. Expected OpCode 0x%02X but got 0x%02X", STM32WLxx_RADIO_COMM_OPCODE_USER_DATA, user_data_frame->opcode);
                            hal_err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
                            break;
                        }
                        else
                        {
                            /* Exclude UDT header from the payload size */
                            const uint32_t udt_payload_len = drv_ctx->last_irq_status.followup_payload_len - (sizeof(stm32wlxx_rcp_user_data_irq_followup_t) - SID_STM32_UTIL_STRUCT_MEMBER_SIZE(stm32wlxx_rcp_user_data_irq_followup_t, data));

                            /* Call user-defined callback */
                            drv_ctx->on_user_data_rx(user_data_frame->data, udt_payload_len, drv_ctx->on_user_data_rx_user_arg);
                        }
                    }
                }
                else
                {
                    STM32WLxx_HAL_LOG_DEBUG("STM32WLxx_APP_IRQ_USER_DATA is masked - skipped");
                }
                hal_err = STM32WLxx_HAL_STATUS_OK;
                break;

            default:
                SID_PAL_LOG_ERROR("Multiple STM32WLxx Radio App IRQ flags reported simultaneously: 0x%x", active_irq);
                hal_err = STM32WLxx_HAL_STATUS_ERROR_INVALID_STATE;
                break;
        }

        /* If this is not a Handshake request we need to acknowledge the IRQ regardless of the errors in the processing */
recovery:
        if (FALSE == handshake_request_active)
        {
            stm32wlxx_hal_status_t tmp_err;

            /* If we are in  error state flush the SPI first so that the GPIO Handshake can proceed */
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                tmp_err = _flush_spi(drv_ctx);
                if (tmp_err != STM32WLxx_HAL_STATUS_OK)
                {
                    STM32WLxx_HAL_LOG_ERROR("Unable to flush STM32WLxx SPI bus. HAL error %u", (uint32_t)tmp_err);
                    break;

                    //TODO: this seems to be a fatal error, handshake won't be possible. Probably we need to disable radio IRQ and report a permanent fault
                }
            }

            /* Send out IRQ acknowledgment to clear the IRQ indication by the STM32WLxx side regardless of any possible local error */
            tmp_err = stm32wlxx_hal_acknowledge_radio_irq(drv_ctx);
            if (tmp_err != STM32WLxx_HAL_STATUS_OK)
            {
                STM32WLxx_HAL_LOG_ERROR("Unable to acknowledge STM32WLxx IRQ status. HAL error %u", (uint32_t)tmp_err);
                break;
            }

            /* Wait for IRQ line to be cleared. Keep in mind this function is invoked from MCU's IRQ context - we cannot wait for long here */
            tmp_err = stm32wlxx_hal_wait_radio_irq_released(drv_ctx, STM32WLxx_HAL_RADIO_IRQ_RELEASE_WAIT_TIME_US);
            if (tmp_err != STM32WLxx_HAL_STATUS_OK)
            {
                STM32WLxx_HAL_LOG_ERROR("STM32WLxx failed to release the IRQ line after successful ACK. HAL error %u", (uint32_t)tmp_err);
                break;
            }

            /* Invoke callbacks after the IRQ is fully processed and acknowledged */
            if (STM32WLxx_HAL_STATUS_OK == hal_err)
            {
                /* SubGHz radio event */
                if (trigger_sid_radio_event_handler != FALSE)
                {
                    /* Call the Sidewalk-specific radio event handler */
                    const int32_t sidewalk_event_proc_error = stm32wlxx_radio_sidewalk_event_process();

                    /* Provide the Sidewalk-specific error outside if storage is supplied */
                    if (out_sidewalk_error != NULL)
                    {
                        *out_sidewalk_error = sidewalk_event_proc_error;
                    }

                    /* Do not set hal_err even if the stm32wlxx_radio_sidewalk_event_process() call reported an error */
                }

                /* Acknowledgment of a request (e.g. standby, sleep, etc.) */
                if (indicate_radio_request_completed != FALSE)
                {
                    /* Clear the ongoing transaction flag to indicate the completion of th request with ACK */
                    drv_ctx->req_with_ack_ongoing = FALSE;
                }
            }

            /* Report any failure, but do not override hal_err with STM32WLxx_HAL_STATUS_OK */
            if (tmp_err != STM32WLxx_HAL_STATUS_OK)
            {
                hal_err = tmp_err;
                break;
            }
        }
    } while (0);
    /*----------------------------------------------------------------------------*/

    /* DANGER ZONE: re-synchronization procedure below must not be interrupted by any other
     * STM32WLxx operation. If you are using SWI handler that runs in IRQ context please
     * make sure your SWI has lower priority than GPIO IRQ for STM32WLxx IRQ line. If SWI
     * handler runs in a task context than no special actions are required since the code
     * below runs in GPIO IRQ context and cannot be interrupted by a task.
     */

    /* If an error occurred we need to do a Handshake request before proceeding --*/
    if ((hal_err != STM32WLxx_HAL_STATUS_OK))
    {
        do
        {
            stm32wlxx_rcp_irq_status_t irq_status;

            SID_PAL_LOG_WARNING("Performing Handshake to reset STM32WLxx state");

            /* Perform GPIO handshake request */
            hal_err = stm32wlxx_hal_gpio_handshake_request(drv_ctx);

