TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_hal.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_set_lora_pkt_params(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const stm32wlxx_radio_lora_phy_pkt_params_t pkt_params)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t set_lora_pkt_params_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SET_LORA_PKT_PARAMS,
        .payload = {
            .set_lora_pkt_params = {
                .packet_params = pkt_params,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (void *)&set_lora_pkt_params_req, sizeof(set_lora_pkt_params_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Set LoRa Packet Params request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_set_lora_cad_params(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const sid_pal_radio_lora_cad_params_t * const cad_params)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t set_lora_cad_params_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SET_LORA_CAD_PARAMS,
        .payload = {
            .set_lora_cad_params = {
                .exit_mode   = STM32WLxx_SUBGHZ_ZIP_CAD_EXIT_MODE((stm32wlxx_pal_radio_cad_param_exit_mode_t)cad_params->cad_exit_mode),
                .detect_peak = cad_params->cad_detect_peak,
                .detect_min  = cad_params->cad_detect_min,
                .timeout     = cad_params->cad_timeout,
                .symbol_num  = cad_params->cad_symbol_num,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (void *)&set_lora_cad_params_req, sizeof(set_lora_cad_params_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Set LoRa CAD Params request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_set_fsk_modulation_params(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const stm32wlxx_radio_fsk_phy_mod_params_t * const mod_params)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t set_fsk_mod_params_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SET_FSK_MOD_PARAMS,
        .payload = {
            .set_fsk_mod_params = {
                .mod_params = *mod_params,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (void *)&set_fsk_mod_params_req, sizeof(set_fsk_mod_params_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Set FSK Modulation Params request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_start_tx(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t start_tx_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_START_TX,
        .payload = {
            .raw = {0},
        },
    };

    err = _spi_transmit_data(drv_ctx, (void *)&start_tx_req, sizeof(start_tx_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Start Tx request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

stm32wlxx_hal_status_t stm32wlxx_hal_radio_start_rx(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint32_t timeout_us)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t start_rx_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_START_RX,
        .payload = {
            .start_rx_params = {
                .timeout_us = timeout_us,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (void *)&start_rx_req, sizeof(start_rx_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Start Rx request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_retrieve_radio_irq(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, stm32wlxx_rcp_irq_status_t * const irq_status,
                                                                                  uint8_t * const followup_data_buf, const uint32_t followup_buf_limit)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;

    /* Validate the inputs. followup_data_buf and followup_buf_limit can be null if the caller does not expect or need the IRQ follow-up data */
    if ((NULL == drv_ctx) || (NULL == irq_status))
    {
        return STM32WLxx_HAL_STATUS_INVALID_ARGS;
    }

    do
    {
        /* Construct the IRQ status read frame
         * IMPORTANT: IRQ status and follow-up data (if any) are preloaded by the STM32WLxx before indicating the IRQ. This means the following:
         *            1. Actual payload of the irq_status_read_req does not matter, STM32WLxx will send out IRQ status anyway. irq_status_read_req is sent for visual reference only
         *            2. Since all the data is preloaded by the STM32WLxx side, this function shall read out everything, even if the caller did not supply the buffer for the follow-up data or if such buffer is too short
         */
        stm32wlxx_radio_comm_spi_frame_t irq_status_read_req = {
            .opcode = STM32WLxx_RADIO_COMM_OPCODE_IRQ_STATUS,
            .payload = {
                .raw = {0},
            }
        };
        stm32wlxx_radio_comm_spi_frame_t irq_status_read_reply;

        /* Read out the IRQ status first */
        err = _spi_transmit_receive_data(drv_ctx, (void *)&irq_status_read_req, (void *)&irq_status_read_reply, sizeof(irq_status_read_reply));
        if (err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_HAL_LOG_ERROR("Unable to read out IRQ status. SPI transfer error %u", (uint32_t)err);
            break;
        }

        /* Check if we've actually received IRQ Status reply and not something else */
        if (irq_status_read_reply.opcode != STM32WLxx_RADIO_COMM_OPCODE_IRQ_STATUS)
        {
            STM32WLxx_HAL_LOG_ERROR("Unable to read out IRQ status. Received opcode 0x%2x instead", irq_status_read_reply.opcode);
            err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
            break;
        }

