TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_hal.c
        /* Return immediatly if the IRQ indication is cleared */
        if (STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_INACTIVE == pin_state)
        {
            debounce_cnt++;
        }
        else
        {
            debounce_cnt = 0u;
        }

        /* Wait a bit to avoid consuming a lot of power and blocking the APB bus */
        sid_pal_delay_us(STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_PROBE_PERIOD_US);
        accumulated_wait_time += STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_PROBE_PERIOD_US;
    }

    if ((debounce_cnt >= STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_PROBE_DEBOUNCE) && (SID_ERROR_NONE == sid_err))
    {
        err = STM32WLxx_HAL_STATUS_OK;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_set_fsk_pkt_params(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, stm32wlxx_pal_radio_fsk_pkt_params_t pkt_params)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t set_fsk_pkt_params_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SET_FSK_PKT_PARAMS,
        .payload = {
            .set_fsk_pkt_params = {
                .packet_params = pkt_params,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (void *)&set_fsk_pkt_params_req, sizeof(set_fsk_pkt_params_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Set FSK Packet Params request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_start_carrier_sense(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const sid_pal_radio_fsk_cad_params_t * const cad_params, const sid_pal_radio_cad_param_exit_mode_t exit_mode)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t start_carrier_sense_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_START_CARRIER_SENSE,
        .payload = {
            .start_fsk_cs_params = {
                .exit_mode         = STM32WLxx_SUBGHZ_ZIP_CAD_EXIT_MODE((stm32wlxx_pal_radio_cad_param_exit_mode_t)exit_mode),
                .min_preamble_det  = cad_params->fsk_cs_min_prm_det,
                .ed_rssi_threshold = cad_params->fsk_ed_rssi_threshold,
                .ed_duration_mus   = cad_params->fsk_ed_duration_mus,
                .lbt_preamble_len  = cad_params->fsk_cs_lbt_preamble_len,
                .lbt_rx_timeout    = cad_params->fsk_cs_lbt_rx_timeout,
                .duration_us       = cad_params->fsk_cs_duration_us,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (void *)&start_carrier_sense_req, sizeof(start_carrier_sense_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Start Carrier Sense request to SubGHz. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_start_continuous_wave_tx(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint32_t freq)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t start_cw_tx_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_START_CW_TX,
        .payload = {
            .start_cw_tx_params = {
                .frequency = freq,
            },
        }
    };

    err = _spi_transmit_data(drv_ctx, (void *)&start_cw_tx_req, sizeof(start_cw_tx_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Start SubGHz CW Tx request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_start_infinite_preamble_tx(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint32_t freq)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t start_inf_pbl_tx_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_START_INFINITE_PBL_TX,
        .payload = {
            .start_inf_pbl_tx_params = {
                .frequency = freq,
            },
        }
    };

    err = _spi_transmit_data(drv_ctx, (void *)&start_inf_pbl_tx_req, sizeof(start_inf_pbl_tx_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Start SubGHz Infinite Preamble Tx request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_start_continuous_rx(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t start_continuous_rx_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_START_CONTINUOUS_RX,
        .payload = {
            .raw = {0},
        }
    };

    err = _spi_transmit_data(drv_ctx, (void *)&start_continuous_rx_req, sizeof(start_continuous_rx_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Start SubGHz Continuous Rx request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_start_rx_duty_cycle(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint32_t rx_time, const uint32_t sleep_time)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t start_rx_dc_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SET_RX_DUTY_CYCLE,
        .payload = {
            .start_rx_duty_cycle_params = {
                .rx_time    = rx_time,
                .sleep_time = sleep_time,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (void *)&start_rx_dc_req, sizeof(start_rx_dc_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Start SubGHz Rx Duty Cycle request. SPI transfer error %u", (uint32_t)err);
    }

