TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_hal.c
    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_get_live_rssi(halo_drv_stm32wlxx_ctx_t * const drv_ctx, int16_t * const out_rssi)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t get_live_rssi_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_GET_LIVE_RSSI,
        .payload = {
            .raw = {0},
        }
    };

    SID_PAL_ASSERT(out_rssi != NULL);

    do
    {
        /* Request RSSI reading */
        err = _send_request_with_ack(drv_ctx, (void *)&get_live_rssi_req, sizeof(get_live_rssi_req), STM32WLxx_HAL_RADIO_SUBGHZ_GET_LIVE_RSSI_TIMEOUT_MS);

        if (err != STM32WLxx_HAL_STATUS_OK)
        {
            if (STM32WLxx_HAL_STATUS_ERROR_TIMEOUT == err)
            {
                STM32WLxx_HAL_LOG_ERROR("Failed to read live SubGHz RSSI - response timeout");
            }
            else
            {
                STM32WLxx_HAL_LOG_ERROR("Failed to read live SubGHz RSSI. HAL error %u", (uint32_t)err);
            }
            break;
        }

        /* If ACK was received - inspect the received IRQ status */
        const stm32wlxx_req_completed_irq_details_t * const irq_details = &drv_ctx->last_irq_status.req_cmpltd_details;
        if ((drv_ctx->last_irq_status.irq_flags != STM32WLxx_APP_IRQ_SPI_REQ_DONE) || (irq_details->request_id != STM32WLxx_RADIO_COMM_OPCODE_GET_LIVE_RSSI))
        {
            SID_PAL_LOG_ERROR("Failed to read live SubGHz RSSI. IRQ clash detected. Expected 0x%x flag, but got 0x%x, req_id 0x%x",
                              STM32WLxx_RADIO_COMM_OPCODE_GET_LIVE_RSSI, drv_ctx->last_irq_status.irq_flags, irq_details->request_id);
            err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
            break;
        }

        if (irq_details->status != 0u)
        {
            SID_PAL_LOG_ERROR("Failed to read live SubGHz RSSI. STM32WLxx returned error code %u", irq_details->status);
            err = STM32WLxx_HAL_STATUS_ERROR_REJECTED;
            break;
        }

        /* Everything is ok, extract RSSI from the response data */
        *out_rssi = (int16_t)irq_details->additional_info.half_words[0];

        STM32WLxx_HAL_LOG_DEBUG("SubGHz live RSSI: %d", *out_rssi);
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_is_channel_free(halo_drv_stm32wlxx_ctx_t * const drv_ctx, uint32_t freq, int16_t threshold, uint32_t scan_duration_us, bool * is_channel_free)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t is_channel_free_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_CHECK_CHANNEL_FREE,
        .payload = {
            .is_channel_free_params = {
                .frequency      = freq,
                .duration_us    = scan_duration_us,
                .rssi_threshold = (int8_t)threshold,
            },
        }
    };

    SID_PAL_ASSERT(is_channel_free != NULL);
    SID_PAL_ASSERT(threshold >= INT8_MIN);
    SID_PAL_ASSERT(threshold <= INT8_MAX);

    do
    {
        /* Set timeout to the requested scan duration (using math ceiling) plus a fixed safety buffer */
        const uint32_t request_timeout_ms = STM32WLxx_HAL_RADIO_SUBGHZ_IS_CH_FREE_TIMEOUT_MS + ((scan_duration_us + 999u) / 1000u);

        /* Request RSSI reading */
        err = _send_request_with_ack(drv_ctx, (void *)&is_channel_free_req, sizeof(is_channel_free_req), request_timeout_ms);

        if (err != STM32WLxx_HAL_STATUS_OK)
        {
            if (STM32WLxx_HAL_STATUS_ERROR_TIMEOUT == err)
            {
                STM32WLxx_HAL_LOG_ERROR("Failed to check SubGHz channel is free - response timeout");
            }
            else
            {
                STM32WLxx_HAL_LOG_ERROR("Failed to check SubGHz channel is free. HAL error %u", (uint32_t)err);
            }
            break;
        }

        /* If ACK was received - inspect the received IRQ status */
        const stm32wlxx_req_completed_irq_details_t * const irq_details = &drv_ctx->last_irq_status.req_cmpltd_details;
        if ((drv_ctx->last_irq_status.irq_flags != STM32WLxx_APP_IRQ_SPI_REQ_DONE) || (irq_details->request_id != STM32WLxx_RADIO_COMM_OPCODE_CHECK_CHANNEL_FREE))
        {
            SID_PAL_LOG_ERROR("Failed to check SubGHz channel is free. IRQ clash detected. Expected 0x%x flag, but got 0x%x, req_id 0x%x",
                              STM32WLxx_RADIO_COMM_OPCODE_CHECK_CHANNEL_FREE, drv_ctx->last_irq_status.irq_flags, irq_details->request_id);
            err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
            break;
        }

        if (irq_details->status != 0u)
        {
            SID_PAL_LOG_ERROR("Failed to check SubGHz channel is free. STM32WLxx returned error code %u", irq_details->status);
            err = STM32WLxx_HAL_STATUS_ERROR_REJECTED;
            break;
        }

        /* Everything is ok, extract channel status from the response data */
        *is_channel_free = irq_details->additional_info.bytes[0] != 0u;

        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_get_channel_noise(halo_drv_stm32wlxx_ctx_t * const drv_ctx, uint32_t freq, int16_t * const out_noise)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t get_channel_noise_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_GET_CHANNEL_NOISE,
        .payload = {
            .get_channel_noise_params = {
                .frequency = freq,
            },
        }
    };

    SID_PAL_ASSERT(out_noise != NULL);

    do
    {
        /* Request channel noise measurement */
        err = _send_request_with_ack(drv_ctx, (void *)&get_channel_noise_req, sizeof(get_channel_noise_req), STM32WLxx_HAL_RADIO_SUBGHZ_GET_CH_NOISE_TIMEOUT_MS);

        if (err != STM32WLxx_HAL_STATUS_OK)
        {
            if (STM32WLxx_HAL_STATUS_ERROR_TIMEOUT == err)
            {
                STM32WLxx_HAL_LOG_ERROR("Failed to measure SubGHz channel noise - response timeout");
            }
            else
            {
                STM32WLxx_HAL_LOG_ERROR("Failed to measure SubGHz channel noise. HAL error %u", (uint32_t)err);
            }
            break;
        }

        /* If ACK was received - inspect the received IRQ status */
        const stm32wlxx_req_completed_irq_details_t * const irq_details = &drv_ctx->last_irq_status.req_cmpltd_details;
        if ((drv_ctx->last_irq_status.irq_flags != STM32WLxx_APP_IRQ_SPI_REQ_DONE) || (irq_details->request_id != STM32WLxx_RADIO_COMM_OPCODE_GET_CHANNEL_NOISE))
        {
            SID_PAL_LOG_ERROR("Failed to measure SubGHz channel noise. IRQ clash detected. Expected 0x%x flag, but got 0x%x, req_id 0x%x",
                              STM32WLxx_RADIO_COMM_OPCODE_GET_CHANNEL_NOISE, drv_ctx->last_irq_status.irq_flags, irq_details->request_id);
            err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
            break;
        }

        if (irq_details->status != 0u)
        {
            SID_PAL_LOG_ERROR("Failed to measure SubGHz channel noise. STM32WLxx returned error code %u", irq_details->status);
            err = STM32WLxx_HAL_STATUS_ERROR_REJECTED;
            break;
        }

        /* Everything is ok, extract channel noise from the response data */
        *out_noise = (int16_t)irq_details->additional_info.half_words[0];

        STM32WLxx_HAL_LOG_DEBUG("SubGHz channel noise: %d", *out_noise);
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

