TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_hal.c
    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_start_lora_cad(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t start_lora_cad_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_START_LORA_CAD,
        .payload = {
            .raw = {0},
        }
    };

    err = _spi_transmit_data(drv_ctx, (void *)&start_lora_cad_req, sizeof(start_lora_cad_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Start LoRa CAD request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_send_user_data(halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const data, const uint32_t data_len)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;

    SID_PAL_ASSERT(drv_ctx->config->internal_buffer.p != NULL);
    SID_PAL_ASSERT(data_len <= STM32WLxx_RADIO_COMM_SUBGHZ_TX_MAX_SIZE);

    stm32wlxx_rcp_user_data_t * const user_data_frame = (stm32wlxx_rcp_user_data_t *)(void *)drv_ctx->config->internal_buffer.p;

    user_data_frame->opcode      = STM32WLxx_RADIO_COMM_OPCODE_USER_DATA;
    user_data_frame->data_length = (uint16_t)data_len;
    SID_STM32_UTIL_fast_memcpy(user_data_frame->data, data, data_len);

    uint32_t actual_frame_length = sizeof(*user_data_frame) - sizeof(user_data_frame->data) + data_len;

    err = _spi_transmit_data(drv_ctx, (uint8_t *)(void *)user_data_frame, actual_frame_length);
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        /* SPI failed */
        STM32WLxx_HAL_LOG_ERROR("Unable to send user data to the STM32WLxx side. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_radio_hal_init_gpio(halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    sid_error_t sid_err;

    do
    {
        /* Configure bi-directional IRQ line -----------------------------------------*/
        sid_err = sid_pal_gpio_pull_mode(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_PULL_UP);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_pull_mode() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.radio_irq);
            err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
            break;
        }
        sid_err = sid_pal_gpio_input_mode(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_INPUT_CONNECT);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_input_mode() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.radio_irq);
            err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
            break;
        }
        sid_err = sid_pal_gpio_set_direction(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_DIRECTION_INPUT);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_set_direction() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.radio_irq);
            err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
            break;
        }
#if (CFG_LPM_STDBY_SUPPORTED != 0)
        sid_err = sid_pal_gpio_ext_ifc_standby_retention_enable(drv_ctx->config->gpio.radio_irq);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_ext_ifc_standby_retention_enable() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.radio_irq);
            err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
            break;
        }
#endif /* CFG_LPM_STDBY_SUPPORTED */
        /*----------------------------------------------------------------------------*/

#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Configure status LED ------------------------------------------------------*/
        /* Tx LED */
        if (HALO_GPIO_NOT_CONNECTED != drv_ctx->config->gpio.tx_led)
        {
            /* Make sure LED won't glitch - put GPIO output to Off state before the pin is configured as output */
            stm32wlxx_radio_hal_tx_led_off(drv_ctx);

            sid_err = sid_pal_gpio_output_mode(drv_ctx->config->gpio.tx_led, SID_PAL_GPIO_OUTPUT_PUSH_PULL);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_output_mode() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.tx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
            sid_err = sid_pal_gpio_set_direction(drv_ctx->config->gpio.tx_led, SID_PAL_GPIO_DIRECTION_OUTPUT);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_set_direction() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.tx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
        }

        /* Rx LED */
        if ((HALO_GPIO_NOT_CONNECTED != drv_ctx->config->gpio.rx_led) && (drv_ctx->config->gpio.rx_led != drv_ctx->config->gpio.tx_led))
        {
            stm32wlxx_radio_hal_rx_led_off(drv_ctx);

            sid_err = sid_pal_gpio_output_mode(drv_ctx->config->gpio.rx_led, SID_PAL_GPIO_OUTPUT_PUSH_PULL);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_output_mode() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.rx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
            sid_err = sid_pal_gpio_set_direction(drv_ctx->config->gpio.rx_led, SID_PAL_GPIO_DIRECTION_OUTPUT);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_set_direction() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.rx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
        }
        /*----------------------------------------------------------------------------*/
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

